<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Pardevejs;


class PardevejsSeeder extends Seeder
{
    public function run()
    {
        $data = [
            ['120399-12345', 'Juris', 'Bērziņš', '+37121234567', 'LV12HABA0001408059384', 8],
            ['160299-23456', 'Laura', 'Ozola', '+37122050305', 'LV39HABA0551036716615', 9],
            ['110499-34567', 'Mārtiņš', 'Liepiņš', '+37129684735', 'LV76HABA0001408031042', 7],
            ['150198-45678', 'Andris', 'Kalniņš', '+37129111111', 'LV04HABA0551021603838', 9],
            ['130399-56789', 'Līga', 'Cīrule', '+37126543210', 'LV80HABA0001408056175', 6],
            ['080299-67890', 'Guntars', 'Pētersons', '+37125475953', 'LV33HABA0551030782396', 7],
            ['170199-78901', 'Inga', 'Zariņa', '+37120202020', 'LV32HABA0551032823828', 8],
            ['120399-89012', 'Agnese', 'Birzīte', '+37929483355', 'LV93HABA0001408089154', 9],
            ['200499-90123', 'Ieva', 'Briede', '+37926037723', 'LV07HABA0551017732592', 6],
            ['080199-01234', 'Pēteris', 'Osis', '+37929505147', 'LV69HABA0551012401544', 8],
            ['060399-12345', 'Liene', 'Saulīte', '+37928621507', 'LV55HABA0001408045389', 7],
            ['050199-23456', 'Anda', 'Jansone', '+37126888888', 'LV74HABA0551020205843', 9],
            ['170399-34567', 'Maija', 'Bērziņa', '+37125964433', 'LV07HABA0551036363261', 6],
            ['130199-45678', 'Kaspars', 'Zariņš', '+37129425515', 'LV87HABA0551028952851', 8],
            ['123456-78901', 'Jānis', 'Bērziņš', '+37122222222', 'LV12HABA0001408053621', 8],
            ['482344-27845', 'Laura', 'Liepa', '+37120000000', 'LV32UNLA0050004367891', 9],
            ['677892-43612', 'Andris', 'Kalniņš', '+37126666666', 'LV90CBBH0071052048701', 7],
            ['892315-09876', 'Inga', 'Saulīte', '+37127777777', 'LV33PARX0003173835649', 6],
            ['761234-12345', 'Maija', 'Ozola', '+37128888888', 'LV80HABA0551048673269', 8],
            ['981234-56789', 'Artūrs', 'Lūsis', '+37129999999', 'LV76HABA0551031005111', 7],
            ['664422-13354', 'Gundars', 'Briedis', '+37127777777', 'LV44HABA0551038275094', 9],
            ['498273-12398', 'Dace', 'Zariņa', '+37121111111', 'LV50HABA0001408053621', 8],
            ['123985-12387', 'Ivars', 'Līcis', '+37127777777', 'LV06HABA0551026587771', 6],
            ['534921-09876', 'Liene', 'Bērziņa', '+37126666666', 'LV05HABA0551049556767', 9],
            ['122345-67890', 'Edgars', 'Krauklis', '+37123333333', 'LV92CBBH0071062391809', 7],
            ['663428-87612', 'Kristīne', 'Kļava', '+37129999999', 'LV09HABA0551037092568', 8],
            ['441234-51234', 'Aivars', 'Bērziņš', '+37128888888', 'LV16HABA0551031647503', 6],
            ['872155-12308', 'Laima', 'Zaķe', '+37124444444', 'LV40HABA0551037332071', 9],
            ['512414-21444', 'Kellija', 'Bukse', '+37126543555', 'LV40HABA0551015432071', 5],
            ['892315-11876', 'Dzilna', 'Saulīte', '+37127447777', 'LV33CARX0003173835649', 6],
        ];

        foreach ($data as $item) {
            Pardevejs::create([
                'PK' => $item[0],
                'Vards' => $item[1],
                'Uzvards' => $item[2],
                'Telefona_nr' => $item[3],
                'Konta_nr' => $item[4],
                'Kvalitate' => $item[5],
            ]);
        }
    }
}
